'''
При спокойной зиме существует возможность поставок 2200 кубометров природного и 3500 сжиженного газа, 
а при наступлении сильных морозов 3800 кубометров природного и 2450 сжиженного. 
Себестоимость добычи и транспортировки одного кубометра природного газа составляют 19 денежные единицы, 
сжиженного – 25. 
При этом конечная цена для потребителя составит 35 и 58 денежных единиц соответственно. 



Хорошие условия:
2200 кубометров природного и 3500 сжиженного газа

Плохие условия:
3800 кубометров природного и 2450 сжиженного

Оптимальная стратегия

X = 4032 Y = 2970
X = 3032 Y = 2954
X = 578 Y = 1970
X = 3132 Y = 2854


Себестоимость газа:
19 - природный 
25 - сжиженный

Цена для потребителя:
35 - природный
58 - сжиженный

'''


def neft(x: int, y: int):
    pass 